app/Http/Controllers/Api/CartController.php

    public function index($buy = null)
    {
       // dd($buy);

        $user = auth()->user();
        if ($buy) {
            $carts_data = Cart::where('creator_id', $user->id)->where('type', 'buy_now')
                ->with([
                    'user',
                    'webinar',
                    'reserveMeeting' => function ($query) {
                        $query->with([
                            'meeting',
                            'meetingTime'
                        ]);
                    },
                    'ticket',
                    'productOrder' => function ($query) {
                        $query->whereHas('product');
                        $query->with(['product']);
                    }
                ])
                ->get();
        } else { //dd('hello');
            $carts_data = Cart::where('creator_id', $user->id)
            ->where('type',null)
                ->with([
                    'user',
                    'webinar',
                    'reserveMeeting' => function ($query) {
                        $query->with([
                            'meeting',
                            'meetingTime'
                        ]);
                    },
                    'ticket',
                    'productOrder' => function ($query) {
                        $query->whereHas('product');
                        $query->with(['product']);
                    }
                ])
                ->get();
---
select * from `cart` where `creator_id` = 1040 and `type` is null
select * from `product_orders` where 0 = 1 and exists (select * from `products` where `product_orders`.`product_id` = `products`.`id`)
select * from `reserve_meetings` where 0 = 1
select * from `tickets` where 0 = 1

            if ($calculate) {

                //cart data not comming now so i am using again cart
                $carts_data = Cart::where('creator_id', $user->id)
                    ->where('type',null)
                    ->with([
                        'user',
                        'webinar',
                        'reserveMeeting' => function ($query) {
                            $query->with([
                                'meeting',
                                'meetingTime'
                            ]);
                        },
                        'ticket',
                        'productOrder' => function ($query) {
                            $query->whereHas('product');
                            $query->with(['product']);
                        }
                    ])
                    ->get();
---
select * from `cart` where `creator_id` = 1040 and `type` is null
select * from `product_orders` where 0 = 1 and exists (select * from `products` where `product_orders`.`product_id` = `products`.`id`)
select * from `reserve_meetings` where 0 = 1
select * from `tickets` where 0 = 1

    private function getUserLocationsData($user)
    {
        $provinces = null;
        $cities = null;
        $districts = null;

        $countries = Region::select(DB::raw('*, ST_AsText(geo_center) as geo_center'))
            ->where('type', Region::$country)
            ->get();
---
select *, ST_AsText(geo_center) as geo_center from `regions` where `type` = 'country'

    public function checkOutFree(Request $request, $carts = null)
    {
        $user = auth()->user(); //we binars
        // dd($request->webinar_id);
        $checkFree = Webinar::where('id', $request->webinar_id)->first();
        if ($checkFree == null) {
            return response(['statusCode' => 404, 'message' => "data not found"]);
        }
        //dd($checkFree);
        if ($checkFree->price == null or $checkFree->price == 0) {
            // dd('hello free');
            $checkOrder = Order::where('user_id', $user->id)->where('webinar_id', $request->webinar_id)->first();
            //dd($checkOrder);
            if ($checkOrder == null) {
                $order = Order::create([
                    'user_id' => $user->id,
                    'status' => 'free',
                    'webinar_id' => $request->webinar_id,
                    'amount' => '0',
                    'tax' => '0',
                    'total_discount' => '0',
                    'total_amount' => '0',
                    'product_delivery_fee' => '0',
                    'created_at' => time(),
                ]);
---
select * from `webinars` where `id` = '2380' limit 1
select * from `orders` where `user_id` = 1252 and `webinar_id` = '2380' limit 1
insert into `orders` (`user_id`, `status`, `webinar_id`, `amount`, `tax`, `total_discount`, `total_amount`, `product_delivery_fee`, `created_at`) values (1252, 'free', '2380', '0', '0', '0', '0', '0', 1681290485)

                //$seller_id = OrderItem::getSeller($orderDetails);
                // dd($seller_id);
                //$sale = new Sale();
                $sale = Sale::create([
                    'buyer_id' => $orderDetails->user_id,
                    'seller_id' => $checkFree->creator_id,
                    'order_id' => $orderDetails->order_id,
                    'webinar_id' => $orderDetails->webinar_id,
                    'bundle_id' => $orderDetails->bundle_id ?? null,
                    'meeting_id' => !empty($orderDetails->reserve_meeting_id) ? $orderDetails->reserveMeeting->meeting_id : null,
                    'subscribe_id' => $orderDetails->subscribe_id ?? null,
                    'promotion_id' => $orderDetails->promotion_id ?? null,
                    'registration_package_id' => $orderDetails->registration_package_id ?? null,
                    'product_order_id' => $orderDetails->product_order_id ?? null,
                    'type' => $checkFree->type,
                    'payment_method' => 'free',
                    'amount' => $orderDetails->amount ?? null,
                    'tax' => $orderDetails->tax_price ?? null,
                    'commission' => $orderDetails->commission_price ?? null,
                    'discount' => $orderDetails->discount ?? null,
                    'total_amount' => $orderDetails->total_amount ?? null,
                    'product_delivery_fee' => $orderDetails->product_delivery_fee ?? null,
                    'created_at' => time(),
                ]);
---
insert into `sales` (`buyer_id`, `seller_id`, `order_id`, `webinar_id`, `bundle_id`, `meeting_id`, `subscribe_id`, `promotion_id`, `registration_package_id`, `product_order_id`, `type`, `payment_method`, `amount`, `tax`, `commission`, `discount`, `total_amount`, `product_delivery_fee`, `created_at`) values (1252, 1102, 3696, '2380', '', '', '', '', '', '', 'one_liner', 'free', '', '', '', '', '', '', 1681290485)