app/Http/Controllers/Api/CategoryController.php

select * from `trend_categories` order by `created_at` desc limit 6
select * from `categories` where `parent_id` is null and `status` = '1'
---
       public  function get_category_list(Request $request){
        //$get_category=Category::get();

          $trendCategories = TrendCategory::with([
                'category' => function ($query) {
                    $query->withCount([
                        'webinars' => function ($query) {
                            $query->where('status', 'active');
                        }
                    ]);
                }
            ])->orderBy('created_at', 'desc')
                ->limit(6)
                ->get();

        $browse_category=Category::where('parent_id','=',null)->where('status', '1')->with(['subCategories'])->get();

update `users` set `course_category_id` = '643' where `id` = 1040
---
    public function update_category(Request $request){
        $user = Auth::user();

       // dd($user->id);
        $category_id = $request->cat_id;
      //  $save_user_detail->course_category_id=$request->category_id;


        // $category = User::where('id' , $user->id)->update(
        //   [ 'course_category_id' =>  $category_id,]
        // );
        $user->course_category_id = $category_id;
        $user->save();