app/Http/Controllers/Api/CourseController.php

select * from `webinars` where `slug` = 'PPCS Prelims Paper' limit 1
---
            return response(['statusCode' => 200, 'message' => 'course detail', 'data' => $data]);
        }

         $webinar = Webinar::where('slug', $slug)->first();

select * from `users` where `users`.`id` in (1102)
---
                    $query->with([
                        'user' => function ($query) {
                            $query->select('id', 'full_name', 'role_name', 'role_id', 'avatar');
                        },
                        'replies' => function ($query) {
                            $query->where('status', 'active');
                            $query->with([
                                'user' => function ($query) {
                                    $query->select('id', 'full_name', 'role_name', 'role_id', 'avatar');
                                }
                            ]);
                        }
                    ]);
                    $query->orderBy('created_at', 'desc');
                },
            ])
            ->withCount([
                'sales' => function ($query) {
                    $query->whereNull('refund_at');
                },
                'noticeboards'
            ])
            ->where('status', 'active')
            ->first();

select * from `favorites` where `webinar_id` = 2370 and `user_id` = 1252 limit 1
---
        $isFavorite = false;

        if (!empty($user)) {
            $isFavorite = Favorite::where('webinar_id', $course->id)
                ->where('user_id', $user->id)
                ->first();

select * from `advertising_banners` where `published` = 1 and `position` in ('course', 'course_sidebar')
---
            $webinarContentCount += $course->assignments->count();
        }

        $advertisingBanners = AdvertisingBanner::where('published', true)
            ->whereIn('position', ['course', 'course_sidebar'])
            ->get();

select * from `text_lessons` where `id` = 18 limit 1
---
    private function text_lesson($id)
    {
        //dd('hello',$id);
        $sessions = TextLesson::where('id',$id)->first();

select `id` from `categories` where `parent_id` = 643
select count(*) as aggregate from `webinars` where `webinars`.`type` = 'currentaffairs' and `category_id` in (644, 645, 646, 692, 697, 702)
select count(*) as aggregate from `webinars` where `webinars`.`type` = 'currentaffairs' and `category_id` in (644, 645, 646, 692, 697, 702) and `webinars`.`status` = 'pending'
select sum(`duration`) as aggregate from `webinars` where `webinars`.`type` = 'currentaffairs' and `category_id` in (644, 645, 646, 692, 697, 702)
select * from `tags` where `tags`.`webinar_id` in (0)
select count(sales.webinar_id) as sales_count from `webinars` inner join `sales` on `webinars`.`id` = `sales`.`webinar_id` where `webinars`.`type` = 'currentaffairs' and `category_id` in (644, 645, 646, 692, 697, 702) and `sales`.`webinar_id` is not null and `sales`.`refund_at` is null limit 1
select * from `categories` where `parent_id` is null
---
    public function previousyearpaper(Request $request)
    {   //dd('hello');
       // $this->authorize('admin_webinars_list');

        removeContentLocale();
        $sub_id = Category::where('parent_id',Auth::user()->course_category_id)->pluck('id');
       // dd($sub_id,Auth::user()->course_category_id);
        $type = $request->get('type', 'webinar');
        $query = Webinar::where('webinars.type', $type)->whereIn('category_id',  $sub_id)->with('tags');

        $totalWebinars = $query->count();
        $totalPendingWebinars = deepClone($query)->where('webinars.status', 'pending')->count();
        $totalDurations = deepClone($query)->sum('duration');
        $totalSales = deepClone($query)->join('sales', 'webinars.id', '=', 'sales.webinar_id')
            ->select(DB::raw('count(sales.webinar_id) as sales_count'))
            ->whereNotNull('sales.webinar_id')
            ->whereNull('sales.refund_at')
            ->first();

        $categories = Category::where('parent_id', null)
            ->with('subCategories')
            ->get();