app/Http/Controllers/Api/DashboardController.php

select * from `home_sections` order by `order` asc
---
    public function dashboard(Request $request)
    {

        $homeSections = HomeSection::orderBy('order', 'asc')->get();

select `id` from `categories` where `parent_id` = 684
---
        //       // dd($featureWebinars);
        //     //$selectedWebinarIds = $featureWebinars->pluck('id')->toArray();
        // }//dd('kk');
        $sub_id = Category::where('parent_id',Auth::user()->course_category_id)->pluck('id');

select * from `tickets` where `start_date` < 1681214559 and `end_date` > 1681214559
---
            $now = time();
            $webinarIdsHasDiscount = [];

            $tickets = Ticket::where('start_date', '<', $now)
                ->where('end_date', '>', $now)
                ->get();

select `webinar_id` from `special_offers` where `status` = 'active' and `from_date` < 1681214559 and `to_date` > 1681214559
---
                }
            }

            $specialOffersWebinarIds = SpecialOffer::where('status', 'active')
                ->where('from_date', '<', $now)
                ->where('to_date', '>', $now)
                ->pluck('webinar_id')
                ->toArray();

select `link`, `id` from `advertising_banners` where `published` = 1 and `cat_id` = 684 and `position` = 'App'
---
        //     $forumSection = getForumSectionSettings();
        // }

        $advertisingBanners = AdvertisingBanner::where('published', true)->where('cat_id',Auth::user()->course_category_id)
            ->where('position', 'App')
            ->select('link','id')
            ->get();

select `blog`.`id` as `id`, `blog`.`visit_count` as `visit_count`, `blog_translations`.`title` as `title`, `blog_translations`.`content` as `content`, `blog`.`image` from `blog` inner join `blog_translations` on `blog_translations`.`blog_id` = `blog`.`id` where `category_id` = '39' order by `created_at` desc
select `blog`.`id` as `id`, `blog`.`visit_count` as `visit_count`, `blog_translations`.`title` as `title`, `blog_translations`.`content` as `content`, `blog`.`image` from `blog` inner join `blog_translations` on `blog_translations`.`blog_id` = `blog`.`id` where `category_id` = '40' order by `created_at` desc
---
        $pageRobot = getPageRobot('home');
       // $course_category=Category::where('parent_id','=',null)->whereNotIn('id',[673,674,])->where('id',Auth::user()->course_category_id)->with(['subCategories'])->first();
       // $CurrentAffair = Blog::where('category_id','38')->orderBy('created_at','DESC')->get();
        $LatestNotification =  DB::table('blog')
         ->join('blog_translations','blog_translations.blog_id','blog.id')
         ->select('blog.id as id','blog.visit_count as visit_count','blog_translations.title as title','blog_translations.content as content','blog.image')
         ->where('category_id','39')->orderBy('created_at','DESC')->get();
         $UpcomingNotification = DB::table('blog')
         ->join('blog_translations','blog_translations.blog_id','blog.id')
         ->where('category_id','40')->select('blog.id as id','blog.visit_count as visit_count','blog_translations.title as title','blog_translations.content as content','blog.image')->orderBy('created_at','DESC')
         ->get();