app/Http/Controllers/Api/FavoriteController.php

     public function toggle(Request $request)
    {

           $validator = Validator::make($request->all(), [

            'slug' => 'required'

        ]);

        if ($validator->fails()) {
            $messages = implode(",", $this->errorMessages($validator->errors()));
            return response(['statusCode' => 400, 'message' => $messages]);
        }


        $userId = auth()->id();
        $slug=$request->slug;
        $webinar = Webinar::where('slug', $slug)
            ->where('status', 'active')
            ->first();

        if (!empty($webinar)) {

            $isFavorite = Favorite::where('webinar_id', $webinar->id)
                ->where('user_id', $userId)
                ->first();
---
select * from `webinars` where `slug` = 'enviroment demo video' and `status` = 'active' limit 1
select * from `favorites` where `webinar_id` = 2263 and `user_id` = 1040 limit 1

                ]);
                 return response(['statusCode' => 200, 'message' => 'Create successful']);
            } else {
                 $isFavorite->delete();
---
delete from `favorites` where `id` = 160

    public function toggle_list(Request $request){


      $toggle_list=  Favorite::where('user_id',Auth::user()->id)->with('webinar')->get();
---
select * from `favorites` where `user_id` = 1040
select * from `webinars` where `webinars`.`id` in (2211, 2264, 2367)