app/Http/Controllers/Api/MeetingController.php

select * from `sales` where `buyer_id` = 1040 order by `id` desc
select * from `webinars` where `webinars`.`id` in (2052, 2070, 2081, 2090, 2098, 2102, 2106, 2110, 2138, 2141, 2144, 2145, 2147, 2149, 2150, 2152, 2153, 2155, 2157, 2159, 2160, 2165, 2166, 2167, 2174, 2178, 2179, 2180, 2181, 2182, 2183, 2184, 2185, 2186, 2187, 2188, 2189, 2190, 2191, 2192, 2193, 2194, 2195, 2196, 2197, 2199, 2200, 2201, 2202, 2211, 2212, 2213, 2214, 2215, 2216, 2217, 2218, 2219, 2220, 2221, 2222, 2224, 2225, 2226, 2231, 2244, 2245, 2246, 2247, 2248, 2249, 2250, 2251, 2252, 2253, 2254, 2255, 2256, 2257, 2258, 2259, 2260, 2261, 2262, 2263, 2264, 2265, 2266, 2267, 2268, 2269, 2270, 2271, 2272, 2273, 2274, 2275, 2276, 2277, 2278, 2279, 2280, 2281, 2282, 2283, 2284, 2285, 2286, 2287, 2288, 2289, 2290, 2291, 2292, 2293, 2294, 2295, 2296, 2297, 2298, 2299, 2300, 2301, 2302, 2303, 2304, 2305, 2306, 2307, 2308, 2309, 2310, 2311, 2312, 2313, 2314, 2315, 2316, 2317, 2318, 2319, 2320, 2321, 2322, 2323, 2324, 2325, 2326, 2327, 2328, 2329, 2330, 2331, 2332, 2333, 2334, 2335, 2336, 2337, 2338, 2339, 2340, 2341, 2342, 2343, 2344, 2345, 2346, 2347, 2348, 2349, 2350, 2351, 2352, 2353, 2354, 2355, 2356, 2357, 2358, 2359, 2360, 2363, 2364, 2365, 2366, 2367, 2370, 2371, 2372, 2376, 2378, 2379, 2380, 2392, 2393, 2394, 2395, 2396, 2397, 2398, 2399, 2400, 2401, 2409, 2410, 2411, 2412, 2413, 2414, 2415, 2416, 2417, 2418, 2419, 2420, 2438, 2439, 2440, 2441, 2442)
---
     public function manage_meeting(Request $request){

         $user = auth()->user();


           $data_bigbl= \Bigbluebutton::all();

            $webinar_data=Sale::with('webinar.sessions.meeting_title')->where('buyer_id',$user->id)->orderBy('id', 'DESC')->get();

select * from `recording_lists` where `meetingID` = '215'
select * from `webinars` where `webinars`.`id` in (2070)
---

        }
        }
     $recording_list=DB::table('recording_lists')->where('meetingID',$id)->get();



            $session_data=    Session::with(['webinar','meeting_title'])->where('id',(int)$id)->first();