app/Http/Controllers/Api/MyPurchaseController.php

                    'teacher' => function ($query) {
                        $query->select('id', 'full_name');
                    },
                ]);
                $query->withCount([
                    'sales' => function ($query) {
                        $query->whereNull('refund_at');
                    }
                ]);
            },
            'bundle' => function ($query) {
                $query->with([
                    'reviews' => function ($query) {
                        $query->where('status', 'active');
                    },
                    'category',
                    'teacher' => function ($query) {
                        $query->select('id', 'full_name');
                    },
                ]);
            }
        ])
        ->orderBy('created_at', 'desc')
        ->paginate(10);
---
select * from `categories` where `categories`.`id` in (665)