app/Http/Controllers/Api/QuizQuestController.php

       public function quizquestionlist(Request $request){
             $validator = Validator::make($request->all(), [

            'quiz_id' => 'required'

        ]);

        if ($validator->fails()) {
            $messages = implode(",", $this->errorMessages($validator->errors()));
            return response(['statusCode' => 400, 'message' => $messages]);
        }
        $id=$request->quiz_id;
        // $c_id=$request->webinar_id;

        //  $question = Quiz::where('webinar_id', $c_id)

        //     //->with('quizzesQuestionsAnswers')
        //     ->pluck('id');
        //     dd($question);

        $question = Quiz::where('id', $id)
        ->with([
            'quizQuestions' => function ($query) {
                $query->with('quizzesQuestionsAnswers');
            },
        ])
        ->first();
---
select * from `quizzes_questions_answers` where `quizzes_questions_answers`.`question_id` in (4697, 4698, 4699, 4700, 4701, 4702, 4703, 4704, 4705, 4706, 4707, 4708, 4709, 4710, 4711, 4712, 4713, 4714, 4715, 4716, 4717, 4718, 4719, 4720, 4721, 4722, 4723, 4724, 4725, 4726, 4727, 4728, 4729, 4730, 4731, 4732, 4733, 4734, 4735, 4736, 4737, 4738, 4739, 4740, 4741, 4742, 4743, 4744, 4745, 4746, 4747, 4748, 4749, 4750, 4751, 4752, 4753, 4754, 4755, 4756, 4757, 4758, 4759, 4760, 4761, 4762, 4763, 4764, 4765, 4766, 4767, 4768, 4769, 4770, 4771, 4772, 4773, 4774, 4775, 4776, 4777, 4778, 4779, 4780, 4781, 4782, 4783, 4784, 4785, 4786, 4787, 4788, 4789, 4790, 4791, 4792, 4793, 4794, 4795, 4796)