app/Http/Controllers/Api/RegistrationController.php

     public function verify_opt(Request $request){
           $validator = Validator::make($request->all(), [
             'mobile' => 'required',
            // 'otp'=>'required'
        ]);
             if ($validator->fails()) {
            $messages = implode(",", $this->errorMessages($validator->errors()));
            return response(['statusCode' => 400, 'message' => $messages]);
        }

          $userexists= User::where('mobile',$request->mobile)->first();

            if( $userexists){
               $exist= DB::table('opts')->where('user_id', $userexists->id)->first();
---
select * from `users` where `mobile` = '+919877579748' limit 1
select * from `opts` where `user_id` = 1252 limit 1

        public function get_profile(Request $request){
            $user_detail=User::where('id',Auth::user()->id)->first();
---
select * from `users` where `id` = 1283 limit 1