app/Http/Controllers/Api/SupportController.php

    public function tickets(Request $request, $id = null)
    {
        $user = auth()->user();

        $query = Support::whereNotNull('department_id')
            ->where('user_id', $user->id);

        $supportsCount = deepClone($query)->count();
        $openSupportsCount = deepClone($query)->where('status', 'open')->count();
        $closeSupportsCount = deepClone($query)->where('status', 'close')->count();

        $query = $this->filters($query, $request);

        $supports = $query->orderBy('created_at', 'desc')
            ->orderBy('status', 'asc')
            ->with([
                'user' => function ($query) {
                    $query->select('id', 'full_name', 'avatar', 'role_name');
                },
                'department',
                'conversations' => function ($query) {
                    $query->orderBy('created_at', 'desc')
                        ->first();
                }
            ])->get();

        $departments = SupportDepartment::all();
---
select count(*) as aggregate from `supports` where `department_id` is not null and `user_id` = 1040
select count(*) as aggregate from `supports` where `department_id` is not null and `user_id` = 1040 and `status` = 'open'
select count(*) as aggregate from `supports` where `department_id` is not null and `user_id` = 1040 and `status` = 'close'
select `id`, `full_name`, `avatar`, `role_name` from `users` where `users`.`id` in (1040)
select * from `supports` where `department_id` is not null and `user_id` = 1040 order by `created_at` desc, `status` asc
select * from `support_departments`