app/User.php

select * from `groups` where `groups`.`id` = 2 limit 1
---
    public function getUserGroup()
    {
        if (empty($this->user_group)) {
            if (!empty($this->userGroup) and !empty($this->userGroup->group) and $this->userGroup->group->status == 'active') {

select * from `sales` where `buyer_id` = 1040 and `webinar_id` is not null and `type` = 'webinar' and `refund_at` is null
---
    public function getPurchasedCoursesIds()
    {
        $webinarIds = [];

        $sales = Sale::where('buyer_id', $this->id)
            ->whereNotNull('webinar_id')
            ->where('type', 'webinar')
            ->whereNull('refund_at')
            ->get();