app/Helpers/helper.php

select * from `navbar_buttons` where `role_id` = 1 limit 1
---
function getNavbarButton($roleId = null)
{
    if (empty($roleId)) {
        $roleId = \App\Models\Role::getUserRoleId();
    }

    $navButton = \App\Models\NavbarButton::where('role_id', $roleId)->first();