app/Http/Controllers/Panel/QuizController.php

    public function start(Request $request, $id)
    {
        $quiz = Quiz::where('id', $id)
            ->with([
                'quizQuestions' => function ($query) {
                    $query->with('quizzesQuestionsAnswers');
                },
            ])
            ->first();
            //    dd($quiz);
        $user = auth()->user();

        if ($quiz) {
            $userQuizDone = QuizzesResult::where('quiz_id', $quiz->id)
                ->where('user_id', $user->id)
                ->get();
                // dd($userQuizDone);
            $status_pass = false;
            foreach ($userQuizDone as $result) {
                if ($result->status == QuizzesResult::$passed) {
                    $status_pass = true;
                }
            }

            if (!isset($quiz->attempt) or ($userQuizDone->count() < $quiz->attempt)) {
                $newQuizStart = QuizzesResult::create([
                    'quiz_id' => $quiz->id,
                    'user_id' => $user->id,
                    'course_id' => $request->course_id ?? null,
                    'results' => '',
                    'user_grade' => 0,
                    'status' => 'waiting',
                    'created_at' => time()
                ]);
---
select * from `quizzes_questions_answers` where `quizzes_questions_answers`.`question_id` in (314, 315, 316, 317, 318, 319, 320, 321, 322, 323, 394, 395, 396, 397, 398, 399, 400, 401, 402, 403)
select * from `quizzes_results` where `quiz_id` = 89 and `user_id` = 1040
insert into `quizzes_results` (`quiz_id`, `user_id`, `course_id`, `results`, `user_grade`, `status`, `created_at`) values (89, 1040, '', '', 0, 'waiting', 1681241645)

    public function myResults(Request $request)
    {   //dd(auth()->user()->id);
        //dd($request->all());
        $query = QuizzesResult::where('user_id', auth()->user()->id);

        $quizResultsCount = deepClone($query)->count();
        $passedCount = deepClone($query)->where('status', \App\Models\QuizzesResult::$passed)->count();
        $failedCount = deepClone($query)->where('status', \App\Models\QuizzesResult::$failed)->count();
        $waitingCount = deepClone($query)->where('status', \App\Models\QuizzesResult::$waiting)->count();

        $query = $this->resultFilters($request, deepClone($query));

        $quizResults = $query->with([
            'quiz' => function ($query) {
                $query->with(['quizQuestions', 'creator', 'webinar']);
            }
        ])->orderBy('created_at', 'desc')
            ->paginate(10);
---
select count(*) as aggregate from `quizzes_results` where `user_id` = 1040
select count(*) as aggregate from `quizzes_results` where `user_id` = 1040 and `status` = 'passed'
select count(*) as aggregate from `quizzes_results` where `user_id` = 1040 and `status` = 'failed'
select count(*) as aggregate from `quizzes_results` where `user_id` = 1040 and `status` = 'waiting'
select * from `quizzes_results` where `user_id` = 1040 order by `created_at` desc limit 10 offset 0
select * from `users` where `users`.`id` in (1102)
select * from `webinars` where `webinars`.`id` in (2255, 2262)