app/Models/Webinar.php

select * from `sales` where `buyer_id` = 1252 and `webinar_id` = 2370 and `type` = 'webinar' and `refund_at` is null and `access_to_purchased_item` = 1 limit 1
---
    public function checkUserHasBought($user = null, $checkExpired = true): bool
    {
        $hasBought = false;

        if (empty($user) and auth()->check()) {
            $user = auth()->user();
        }

        if (!empty($user)) {
            $sale = Sale::where('buyer_id', $user->id)
                ->where('webinar_id', $this->id)
                ->where('type', 'webinar')
                ->whereNull('refund_at')
                ->where('access_to_purchased_item', true)
                ->first();

select * from `bundle_webinars` where `webinar_id` = 2370
---
            }

            if (!$hasBought) {
                $bundleWebinar = BundleWebinar::where('webinar_id', $this->id)
                    ->with([
                        'bundle'
                    ])->get();

select * from `special_offers` where `webinar_id` = 2370 and `status` = 'active' and `from_date` < 1681290553 and `to_date` > 1681290553 limit 1
---
    public function activeSpecialOffer()
    {
        $activeSpecialOffer = SpecialOffer::where('webinar_id', $this->id)
            ->where('status', SpecialOffer::$active)
            ->where('from_date', '<', time())
            ->where('to_date', '>', time())
            ->first();